Функция АктивныеКонтактыБезТекущегоПользователя(Знач ВходОперации, Знач ИдентификаторПользователя, Знач РезолверКонтактов) Экспорт
	
	КонтактыСырые = Справочники.Пользователи.АктивныеПользователиПоФильтру(ИдентификаторПользователя, ВходОперации.Лимит, ВходОперации.Порядок, ВходОперации.Сортировка);
	
	Контакты = Новый Массив;
	
	Для Каждого Стр Из КонтактыСырые Цикл
		Идентификатор = РезолверКонтактов.UUIDПоСсылке(Стр.Пользователь);
		Контакт = Новый Структура("Идентификатор, Наименование, Недействителен, Служебный, ПометкаУдаления");
		Контакт.Вставить("Идентификатор", Идентификатор);
		Контакт.Вставить("Наименование", Стр.Наименование);
		Контакт.Вставить("Недействителен", Стр.Недействителен);
		Контакт.Вставить("Служебный", Стр.Служебный);
		Контакт.Вставить("ПометкаУдаления", Стр.ПометкаУдаления);
		
		Контакты.Добавить(Контакт);
	КонецЦикла;
	
	Возврат Контакты;
	
КонецФункции