
Функция СессияПоИдентификатору(Знач ИдентификаторТокена, Знач РезолверПользователей) Экспорт
	Ответ = РегистрыСведений.JWTСессии.СессияПоИдентификатору(ИдентификаторТокена);
	
	Если Не ЗначениеЗаполнено(Ответ.ИдентификаторТокена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пользователь = РезолверПользователей.UUIDПоСсылке(Ответ.Пользователь);
	
	Сессия = Новый Структура;
	Сессия.Вставить("Отозван", Ответ.Отозван);
	Сессия.Вставить("ДействуетДо", Ответ.ДействуетДо);
	Сессия.Вставить("ХэшТокена", Ответ.ХэшТокена);
	Сессия.Вставить("Пользователь", Пользователь);
	Возврат Сессия;

КонецФункции

Процедура ЗаписатьСессию(Знач ИдентификаторТокена, Знач ИдентификаторПользователя, Знач ДействуетДоUTC, Знач ХэшТокена, Знач Отозван, Знач РезолверПользователей) Экспорт
	
	Пользователь = РезолверПользователей.СсылкаПоUUID(ИдентификаторПользователя);
	РегистрыСведений.JWTСессии.ЗаписатьСессию(ИдентификаторТокена, Пользователь, ДействуетДоUTC, ХэшТокена, Отозван);

КонецПроцедуры
