Функция ОбработатьЗапрос(ВходОперации, КонтекстДоступа, Порты) Экспорт
	
	ПроверитьКонтекстДоступа(КонтекстДоступа);
	
	ИдентификаторПользователя = КонтекстДоступа.Субъект.ИдентификаторПользователя; // UUID
	ТекущееВремяUTC = КонтекстДоступа.ТекущееВремяUTC;
	
	Возврат СценарийВыдачаJWT.ВыполнитьСценарий(ИдентификаторПользователя, ТекущееВремяUTC, Порты);
	
КонецФункции

Процедура ПроверитьКонтекстДоступа(Знач Контекст)
	Если Контекст = Неопределено Или ТипЗнч(Контекст) <> Тип("Структура") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"Некорректный контекст доступа.",
			"AUTH.CTX.BAD_TYPE"
		);
	КонецЕсли;
	
	Субъект = Неопределено;
	Если НЕ Контекст.Свойство("Субъект", Субъект) Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует Субъект.",
			"AUTH.CTX.NO_SUBJECT"
		);
	КонецЕсли;
	
	Если ТипЗнч(Субъект) <> Тип("Структура") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует Субъект.",
			"AUTH.CTX.NO_SUBJECT"
		);
	КонецЕсли;
	
	Если НЕ Субъект.Свойство("ИдентификаторПользователя") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует ИдентификаторПользователя.",
			"AUTH.CTX.NO_USERUUID"
		);
	КонецЕсли;
	
	Если НЕ Контекст.Свойство("ТекущееВремяUTC") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует ТекущееВремяUTC.",
			"AUTH.CTX.NO_NOW"
		);
	КонецЕсли;
	
КонецПроцедуры