Функция ПрочитатьТокенИзВХ(АдресВХ) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
	Если ДвоичныеДанные = Неопределено Тогда
		ОшибкиПриложения.ОшибкаДанных("Файл не найден во временном хранилище.", "JWTImport.BAD_INPUT.TOKEN_BAD_FORMAT");
	КонецЕсли;
	
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ИмяВремФайла);
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ИмяВремФайла, КодировкаТекста.UTF8);
	УдалитьФайлы(ИмяВремФайла);
	
	Возврат ТекстДок.ПолучитьТекст();
	
КонецФункции