
Функция СобратьПорты() Экспорт
	Порты = Новый Структура;
	
	Порты.Вставить("Криптография", АдаптерКриптография1С);
	Порты.Вставить("РегистрJWTСессий", АдаптерРегистрJWTСессий);
	Порты.Вставить("РегистрОбластей", АдаптерРегистрОбластей);
	
	Порты.Вставить("РегистрPAT", АдаптерРегистрPAT);
	
	Порты.Вставить("ПользователиИБ", АдаптерПользователиИБ);
	Порты.Вставить("Пользователи", АдаптерПользователи);
	
	Порты.Вставить("ПолитикаОпераций", ПолитикаОпераций);
	Порты.Вставить("Время", АдаптерВремени);
	
	Возврат Порты;
КонецФункции
