Функция ВыполнитьСценарий(Знач ВходОперации, Знач ИдентификаторПользователя, Знач Порты) Экспорт
	
	РезультатРепозитория = Порты.КонтактыДляЧата.АктивныеКонтактыБезТекущегоПользователя(ВходОперации, ИдентификаторПользователя, Порты.Контакты);
	
	КонтактыОтфильтрованные = Новый Массив;
	
	Для Каждого Пользователь Из РезультатРепозитория Цикл
		// можно сделать доп проверки, но с limit не очень хорошо сочетаются
		
		КонтактыОтфильтрованные.Добавить(Пользователь);
	КонецЦикла;
	
	Возврат КонтактыОтфильтрованные;
КонецФункции