
Функция ПредставитьУспех(РезультатБизнеса, КонтекстДоступа, Корреляция, КодУспехаHTTP) Экспорт
	
	Тело = Новый Структура;
	Тело.Вставить("access_token", РезультатБизнеса.ТокенДоступа);
	Тело.Вставить("token_type", РезультатБизнеса.ТипТокена);
	Тело.Вставить("expires_in", РезультатБизнеса.ВремяЖизниСек);
	
	Заголовки = Новый Соответствие;
	
	Заголовки.Вставить("Cache-Control", "no-store");
	Заголовки.Вставить("Pragma", "no-cache");
	
	Возврат Новый Структура("КодHTTP,Тело,Заголовки", КодУспехаHTTP, Тело, Заголовки);
КонецФункции