Функция НайтиПоЛогину(Логин) Экспорт
	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Результат = Новый Структура("СохраняемоеЗначениеПароля, КлючСопоставления", 
		ПользовательИБ.СохраняемоеЗначениеПароля, ПользовательИБ.УникальныйИдентификатор);
	
	Возврат Результат; 
КонецФункции

Функция ПользовательИБСуществует(УИД) Экспорт
	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат ПользовательИБ <> Неопределено; 
КонецФункции