Функция ОбработатьЗапрос(Знач ВходОперации, Знач КонтекстДоступа, Знач Порты) Экспорт
	
	ПроверитьКонтекстДоступа(КонтекстДоступа);
	
	ИдентификаторПользователя = КонтекстДоступа.Субъект.ИдентификаторПользователя; // UUID
	
	Возврат СценарийПолучениеСпискаКонтактов.ВыполнитьСценарий(ВходОперации, ИдентификаторПользователя, Порты);
	
КонецФункции

Процедура ПроверитьКонтекстДоступа(Знач Контекст)
	Если Контекст = Неопределено Или ТипЗнч(Контекст) <> Тип("Структура") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"Некорректный контекст доступа.",
			"AUTH.CTX.BAD_TYPE"
		);
	КонецЕсли;
	
	Субъект = Неопределено;
	Если НЕ Контекст.Свойство("Субъект", Субъект) Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует Субъект.",
			"AUTH.CTX.NO_SUBJECT"
		);
	КонецЕсли;
	
	Если ТипЗнч(Субъект) <> Тип("Структура") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует Субъект.",
			"AUTH.CTX.NO_SUBJECT"
		);
	КонецЕсли;
	
	Если НЕ Субъект.Свойство("ИдентификаторПользователя") Тогда
		ОшибкиПриложения.ОшибкаКонфигурации(
			"В контексте доступа отсутствует ИдентификаторПользователя.",
			"AUTH.CTX.NO_USERUUID"
		);
	КонецЕсли;
	
КонецПроцедуры