Функция ОбластиПоОперации(Операция) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолитикиДоступаОпераций.ТребуемаяОбласть.Идентификатор КАК ТребуемаяОбласть
		|ИЗ
		|	РегистрСведений.ПолитикиДоступаОпераций КАК ПолитикиДоступаОпераций
		|ГДЕ
		|	ПолитикиДоступаОпераций.Операция = &Операция";
	
	Запрос.УстановитьПараметр("Операция", Операция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Области = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Области.Добавить(Выборка.ТребуемаяОбласть);
	КонецЦикла;
	
	Возврат Области;
КонецФункции