Функция СформироватьJWT(Знач ДанныеТокена, Знач КлючПодписи) Экспорт
	
	Токен = Новый ТокенДоступа;
	
	Токен.Эмитент = ДанныеТокена.Эмитент;
	Токен.Идентификатор = ДанныеТокена.ИдентификаторТокена;
	
	Для Каждого Получатель Из ДанныеТокена.Получатели Цикл
		Если СтрДлина(СокрЛП(Строка(Получатель))) > 0 Тогда
			Токен.Получатели.Добавить(Строка(Получатель));
		КонецЕсли;
	КонецЦикла;
	
	Токен.КлючСопоставленияПользователя = ДанныеТокена.КлючСопоставленияПользователя;
	
	Эпоха = Дата(1970, 1, 1, 0, 0, 0);
	Токен.ВремяСоздания = (ДанныеТокена.ВремяСозданияUTC - Эпоха);
	Токен.ВремяЖизни = ДанныеТокена.ВремяЖизниСек;
	
	Если ДанныеТокена.Свойство("Утверждения") Тогда
		Для Каждого Кв Из ДанныеТокена.Утверждения Цикл
			Токен.ПолезнаяНагрузка.Вставить(Кв.Ключ, Кв.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Алгоритм = АлгоритмПодписиТокенаДоступа.RS256;
	КлючПодписи = КлючПодписи.КлючПодписиJWT();
	
	Токен.Подписать(Алгоритм, КлючПодписи);
	
	Возврат Строка(Токен);
	
КонецФункции
