Функция ОбластиПоПользователю(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбластиДоступа.Область.Идентификатор КАК Область
		|ИЗ
		|	РегистрСведений.НазначенияОбластейДоступа КАК ОбластиДоступа
		|ГДЕ
		|	ОбластиДоступа.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Области = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Области.Добавить(Выборка.Область);
	КонецЦикла;
	
	Возврат Области;
	
КонецФункции