
Функция SHA256Hex(Знач Данные) Экспорт
	Двоичные = ПолучитьДвоичныеДанныеИзСтроки(Строка(Данные), КодировкаТекста.UTF8);
	
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(Двоичные);
	
	Возврат ДвоичныеДанныеВHex(Хеш.ХешСумма);
	
КонецФункции

Функция SHA1Base64(Знач Данные) Экспорт
	
	Двоичные = ПолучитьДвоичныеДанныеИзСтроки(Строка(Данные), КодировкаТекста.UTF8);
	
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеш.Добавить(Двоичные);
	Возврат Base64Строка(Хеш.ХешСумма)
	
КонецФункции

Функция ДвоичныеДанныеВHEX(Знач Двоичные) 
	Если Двоичные = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	// Если нужно строго в нижнем регистре:
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Двоичные));
КонецФункции
