Функция ТекущееВремяUTC() Экспорт
	Возврат ТекущаяУниверсальнаяДата();
КонецФункции

Функция ЧасовойПоясТекущегоСеанса() Экспорт
	Возврат ЧасовойПоясСеанса();
КонецФункции

Функция ЛокальнаяДатаСеансаВUTC(Знач ЛокДата) Экспорт
	Если ЛокДата = Неопределено Или ТипЗнч(ЛокДата) <> Тип("Дата") Тогда
		ВызватьИсключение("Ожидалась дата.", КатегорияОшибки.ОшибкаИспользованияВстроенногоЯзыка, "TIME.BAD_DATE");
	КонецЕсли;
	
	Возврат УниверсальноеВремя(ЛокДата, ЧасовойПоясСеанса());
КонецФункции

Функция UTCВЛокальнуюДатуСеанса(Знач ДатаUTC) Экспорт
	Если ДатаUTC = Неопределено Или ТипЗнч(ДатаUTC) <> Тип("Дата") Тогда
		ВызватьИсключение("Ожидалась дата UTC.", КатегорияОшибки.ОшибкаИспользованияВстроенногоЯзыка, "TIME.BAD_UTC");
	КонецЕсли;
	
	Возврат МестноеВремя(ДатаUTC, ЧасовойПоясСеанса());
КонецФункции