
Функция ВыполнитьСценарий(Знач Субъект, Знач ТребуемыеОбласти, Знач ВходАвторизации, Знач Порты) Экспорт
	Если ТипЗнч(Субъект) <> Тип("Структура") Тогда
		Доп = ОшибкиПриложения.ДопИнфоДоступа(ВходАвторизации);
		ОшибкиПриложения.ДоступЗапрещен(
				"Доступ запрещён: некорректный субъект.",
				"API.Доступ.AUTHZ.СубъектНекорректный",
				Доп
			);
	КонецЕсли;
	
	ИдентификаторПользователя = Субъект.ИдентификаторПользователя;
	
	Области = Порты.РегистрОбластей.ПолучитьОбластиПользователя(ИдентификаторПользователя, Порты.Пользователи);
	Если Области = Неопределено Тогда
		Области = Новый Массив;
	КонецЕсли;
	
	Если ТребуемыеОбласти.Количество() > 0 Тогда
		
		Отсутствуют = Новый Массив;
		
		Для Каждого Треб Из ТребуемыеОбласти Цикл
			Если Не МассивСодержитСтроку(Области, Треб) Тогда
				Отсутствуют.Добавить(Треб);
			КонецЕсли;
		КонецЦикла;
		
		Если Отсутствуют.Количество() > 0 Тогда
			Доп = ОшибкиПриложения.ДопИнфоДоступа(ВходАвторизации, Субъект.Схема, Субъект, Отсутствуют);
			
			ОшибкиПриложения.ДоступЗапрещен(
				"Доступ запрещён: отсутствуют требуемые области.",
				"API.Доступ.AUTHZ.ОбластьОтсутствует",
				Доп
			);
		КонецЕсли;
	КонецЕсли;
	
	// КонтекстДоступа
	Контекст = Новый Структура;
	Контекст.Вставить("Субъект", Субъект);
	Контекст.Вставить("Области", Области);
	
	Корр = "";
	Если ВходАвторизации.Свойство("Корреляция", Корр) Тогда
		// ok, необязательное поле
	КонецЕсли;
	
	Контекст.Вставить("Корреляция", Корр);
	Контекст.Вставить("ТекущееВремяUTC", ВходАвторизации.ТекущееВремяUTC);
	
	Возврат Контекст;
КонецФункции

Функция МассивСодержитСтроку(Знач МассивСтрок, Знач Искомая)
	Если МассивСтрок = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Элемент Из МассивСтрок Цикл
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			Если Элемент = Искомая Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции
