
&НаКлиенте
Процедура Авторизоваться(Команда)
	Токен = АвторизоватьсяНаСервере(PATТокен);
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Ошибка");
	Иначе
		JWTТокен = Токен;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция АвторизоватьсяНаСервере(PAT)

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Authorization", PAT);
	
	ПараметрыЗапроса = Новый Соответствие();
	Запрос = Новый Структура("ПараметрыЗапроса,Заголовки", ПараметрыЗапроса, Заголовки);
	
	
	ПортыБизнеса = КомпозицияАвторизацияAPI.СобратьПорты();
	ПортыДоступа = КомпозицияДоступа.СобратьПорты();
	
	Исполнитель = КонтроллерВыдачиТокенаAPI;
	
	Операция = ОперацииAPI.Авторизация_ВыдатьJWT();
	
	Результат = ПайплайнAPI.ВыполнитьПайплайн(Запрос, ПортыДоступа, ПортыБизнеса, Операция, Исполнитель, ПрезентерВыдачиТокенаAPI, Контракт_POST_Аутентификация);
	Если Результат.КодСостояния = 200 Тогда
		СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
		Ответ = УтилитыJSON.JSONВСтруктуру(СтрокаJSON);
		Тoкен = Ответ.access_token;
	Иначе
		Тoкен = Неопределено;
	КонецЕсли;
	
	Возврат Тoкен;
КонецФункции

&НаКлиенте
Процедура BasicAuth(Команда)
	
	Токен = BasicAuthНаСервере(ЛогинПользователяИБ, ПарольПользователяИБ);
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Ошибка");
	Иначе
		JWTТокен = Токен;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция BasicAuthНаСервере(Логин, Пароль)
	Креды = СтрШаблон("%1:%2", Логин, Пароль);
	
	// Важно: кодировку задаём явно, чтобы не зависеть от окружения
	Base64 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Креды, КодировкаТекста.UTF8));
	
	Токен = "Basic " + Base64;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Authorization", Токен);
	
	ПараметрыЗапроса = Новый Соответствие();
	Запрос = Новый Структура("ПараметрыЗапроса,Заголовки", ПараметрыЗапроса, Заголовки);
	
	ПортыБизнеса = КомпозицияАвторизацияAPI.СобратьПорты();
	ПортыДоступа = КомпозицияДоступа.СобратьПорты();
	
	Исполнитель = КонтроллерВыдачиТокенаAPI;
	
	Операция = ОперацииAPI.Авторизация_ВыдатьJWT();
	
	Результат = ПайплайнAPI.ВыполнитьПайплайн(Запрос, ПортыДоступа, ПортыБизнеса, Операция, Исполнитель, ПрезентерВыдачиТокенаAPI, Контракт_POST_Аутентификация);
	Если Результат.КодСостояния = 200 Тогда
		СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
		Ответ = УтилитыJSON.JSONВСтруктуру(СтрокаJSON);
		Тoкен = Ответ.access_token;
	Иначе
		Тoкен = Неопределено;
	КонецЕсли;
	
	Возврат Тoкен;
КонецФункции

&НаКлиенте
Процедура JWT(Команда)

	Токен = JWTНаСервере(JWTТокен);
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Ошибка");
	Иначе
		JWTТокен = Токен;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция JWTНаСервере(Токен)
	
	Authorization = "Bearer " + Токен;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Authorization", Authorization);
	
	ПараметрыЗапроса = Новый Соответствие();
	Запрос = Новый Структура("ПараметрыЗапроса,Заголовки", ПараметрыЗапроса, Заголовки);
	
	ПортыБизнеса = КомпозицияАвторизацияAPI.СобратьПорты();
	ПортыДоступа = КомпозицияДоступа.СобратьПорты();
	
	Исполнитель = КонтроллерВыдачиТокенаAPI;
	
	Операция = ОперацииAPI.Авторизация_ВыдатьJWT();
	
	Результат = ПайплайнAPI.ВыполнитьПайплайн(Запрос, ПортыДоступа, ПортыБизнеса, Операция, Исполнитель, ПрезентерВыдачиТокенаAPI, Контракт_POST_Аутентификация);
	Если Результат.КодСостояния = 200 Тогда
		СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
		Ответ = УтилитыJSON.JSONВСтруктуру(СтрокаJSON);
		Тoкен = Ответ.access_token;
	Иначе
		Тoкен = Неопределено;
	КонецЕсли;
	
	Возврат Тoкен;
КонецФункции

&НаКлиенте
Процедура СгенерироватьPAT(Команда)
	PATТокен = СгенерироватьPATНаСервере();
КонецПроцедуры

&НаСервере
Функция СгенерироватьPATНаСервере()
	Рез = КонтроллерГенерацияPAT.СгенерироватьPAT(
	Пользователь,
	ДействуетДо,
	Описание
	);
	
	Возврат СтрШаблон("%1 %2", "PAT", Рез.PAT);
КонецФункции

&НаКлиенте
Асинх Процедура ЗагрузитьТокен(Команда)

	Парам = Новый ПараметрыДиалогаПомещенияФайлов;
	Парам.Заголовок = "Выберите файл с токеном";
	Парам.МножественныйВыбор = Ложь;
	Парам.Фильтр = "Текст (*.pem;)|*.pem;|Все файлы (*.*)|*.*";
	
	Попытка
		ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(, , , Парам, ЭтаФорма.УникальныйИдентификатор);
	Исключение
		Ждать ПредупреждениеАсинх("Не удалось загрузить файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// Отмена пользователем
	Если ОписаниеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресВХ  = ОписаниеФайла.Адрес;
	ИмяФайла = ОписаниеФайла.СсылкаНаФайл.Имя;
	
	// 2) Всегда спрашиваем перезаписать
	Ответ = Ждать ВопросАсинх(
		"Перезаписать токен?" + Символы.ПС +
		"Файл: " + ИмяФайла,
		РежимДиалогаВопрос.ДаНет
	);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЗагрузитьТокенНаСервере(АдресВХ, ИмяФайла);
	
	Если Результат.Успех Тогда
		Ждать ПредупреждениеАсинх(Результат.Сообщение);
	Иначе
		Ждать ПредупреждениеАсинх(Результат.Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьТокенНаСервере(АдресВХ, ИмяФайла)
	Возврат КонтроллерИмпортаТокена.Импортировать(АдресВХ, ИмяФайла);
КонецФункции

&НаКлиенте
Процедура Контакты(Команда)
	Сообщить(КонтактыНаСервере(JWTТокен));
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтактыНаСервере(Токен)
	
	Authorization = "Bearer " + Токен;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Authorization", Authorization);
	
	ПараметрыЗапроса = Новый Соответствие();
	Запрос = Новый Структура("ПараметрыЗапроса,Заголовки", ПараметрыЗапроса, Заголовки);
	
	ПортыДоступа = КомпозицияДоступа.СобратьПорты();
	ПортыБизнеса = КомпозицияЧатыAPI.СобратьПорты();
	
	Исполнитель = КонтроллерПолученияСпискаКонтактов;
	Презентер = ПрезентерПолученияСпискаКонтактов;
	
	Операция = ОперацииAPI.Чат_Контакты_Прочитать();
	
	Результат = ПайплайнAPI.ВыполнитьПайплайн(Запрос, ПортыДоступа, ПортыБизнеса, Операция, Исполнитель, Презентер, Контракт_GET_ПолучениеСпискаКонтактов);
	Если Результат.КодСостояния = 200 Тогда
		СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
		Ответ = УтилитыJSON.JSONВСтруктуру(СтрокаJSON);
		Результат = Ответ.contacts;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СвязатьПользователяИПользователяИБ(Команда)
	Если СвязатьПользователяИПользователяИБНаСервере(ИДПользователяИБ, Пользователь) Тогда
		Сообщить("Связали");
	Иначе
		Сообщить("Не связали");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвязатьПользователяИПользователяИБНаСервере(Знач ИДПользователяИБ, Знач Пользователь)
	
	Возврат КонтроллерСвязиПользователяИПользователяИБ.Связать(ИДПользователяИБ, Пользователь);
	
КонецФункции