
Функция АктивныеПользователиПоФильтру(Знач Идентификатор, Знач Лимит, Знач Порядок, Знач ПолеСортировки) Экспорт

	Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.Недействителен КАК Недействителен,
	|	Пользователи.Служебный КАК Служебный,
	|	Пользователи.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) <> &Идентификатор
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Служебный
	|	И НЕ Пользователи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Текст);
	
	ЗапросПакета = Схема.ПакетЗапросов[0];
	ОператорВыбрать = ЗапросПакета.Операторы[0];
	ОператорВыбрать.КоличествоПолучаемыхЗаписей = Лимит;

	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции